import math


def area(r):
    return math.pi * r * r
    """
    Вычисляет площадь круга.

    Эта функция принимает радиус круга и возвращает его площадь.

    Параметры:
    r (float): Радиус круга.

    Возвращает:
    float: Площадь круга.

    Исключения:
    ValueError: Если радиус r отрицательный.
    """

def perimeter(r):
    return 2 * math.pi * r
    """
    Вычисляет периметр (длину окружности) круга.

    Эта функция принимает радиус круга и возвращает его периметр.

    Параметры:
    r (float): Радиус круга.

    Возвращает:
    float: Периметр круга.

    Исключения:
    ValueError: Если радиус r отрицательный.
    """
